tutorials/disk/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* dimensions      [1 -1 -2 0 0 0 0]; */

/* internalField   uniform 100000; */

/* boundaryField */
/* { */  
/*       inlet     { type fixedFluxPressure; value $internalField;} */
/*       outlet	  { type fixedFluxPressure; value $internalField;} */
/*       walls     { type fixedFluxPressure; value $internalField;} */

/* } */

/* // ************************************************************************* // */
/* // */


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "procBoundary.*"
    {
        type processor;
        value $internalField;
    }
}

// ************************************************************************* //
